
## Plan Result (prod)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.servicebus-pricing-tier


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.servicebus-pricing-tier will be created
  + resource "azurerm_key_vault_secret" "servicebus-pricing-tier" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-sdt-prod/providers/Microsoft.KeyVault/vaults/civil-sdt-prod"
      + name                    = "civil-sdt-servicebus-pricing-tier"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":569,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->